[{
    "id":0,
    "pergunta": "Como podemos definir o que é um software?",
    "resposta": "é o programa com todos os dados e documentos e configuração"
  },
  {
    "id":1,
    "pergunta":"O que é engenharia de software?",
    "resposta":"é a aplicação de uma abordagem sistemática, disciplinada e quantificável de desenvolvimento de software" 
  },
  {
    "id":2,
    "pergunta":"Qual a meta principal da engenharia de software?",
    "resposta":"desenvolver sistemas com qualidade e bom custo-beneficio" 
  },
  {
    "id":3,
    "pergunta":"Quais os principios fundamentais da engenharia de software?",
    "resposta":"formalidade, abstração, decomposição, generalização, flexibilização" 
  },
  {
    "id":4,
    "pergunta":"O que diz o princípio da formalidade em engenharia de software?",
    "resposta":"o software deve ser desenvolvido de acordo com os passos definidos" 
  },
  {
    "id":5,
    "pergunta":"O que diz o princípio da abstração em engenharia de software?",
    "resposta":"deve-se identificar um determinado fenômeno da realidade sem se preocupar com detalhes" 
  },
  {
    "id":6,
    "pergunta":"O que diz o princípio da decomposição em engenharia de software?",
    "resposta":"dividir o problema em partes para resolver de maneira específica" 
  },
  {
    "id":7,
    "pergunta":"O que diz o princípio da generalização em engenharia de software?",
    "resposta":"esolver um problema de forma genérica para reaproveitar" 
  },
  {
    "id":8,
    "pergunta":"O que diz o princípio da flexibilização em engenharia de software?",
    "resposta":"o software pode ser alterado sem causar problemas a sua execução" 
  },
  {
    "id":9,
    "pergunta":"O que é ciclo de vida de um software?",
    "resposta":"são as fases que um software passa desde a concepção até o desuso" 
  },
  {
    "id":10,
    "pergunta":"Quais são a fases do ciclo de vida de um software de acordo com Sommerville?",
    "resposta":"especificação, desenvolvimento, validação, evolução (edve)" 
  },
  {
    "id":11,
    "pergunta":"Quais são a fases do ciclo de vida de um software de acordo com Pressman?",
    "resposta":"comunicação, planejamento, modelagem, construção e implantação (cpmci)" 
  },
  {
    "id":12,
    "pergunta":"O que é modelo de ciclo de vida de um software?",
    "resposta":"é um modelo que apresenta as fases do ciclo de vida e também como essas fases se relacionam" 
  },
  {
    "id":13,
    "pergunta":"O que é processo de software?",
    "resposta":"conjunto de métodos, práticas e tranformações que guiam a produção de um software" 
  },
  {
    "id":14,
    "pergunta":"Quais os aspectos específicos de um projeto devem ser analisados?",
    "resposta":"características da aplicação, tecnologia adotada, onde será desenvolvido e qual equipe participará" 
  },
  {
    "id":15,
    "pergunta":"Quais são as atividades chave do processo de software?",
    "resposta":"análise, especificação de requisitos, projeto, implementação e testes" 
  },
  {
    "id":16,
    "pergunta":"Quais são as categorias em que os modelos de ciclo de vida podem ser dividos?",
    "resposta":"sequenciais, incrementais e evolutivos" 
  },
  {
    "id":17,
    "pergunta":"Qual a principal característica de um modelo de ciclo de vida em cascata?",
    "resposta":"uma fase só inicia após o termino da fase anterior" 
  },
  {
    "id":18,
    "pergunta":"Quanto a flexibilidade de um processo em cascata, o que se pode dizer?",
    "resposta":"é inflexível" 
  },
  {
    "id":19,
    "pergunta":"O que significa dizer que o modelo em cascata atrasa a redução de risco?",
    "resposta":"só é possível verificar se houve erro nas fases finais que é quando o sistema é testado" 
  },
  {
    "id":20,
    "pergunta":"Quais as consequencias do atraso na redução de riscos do modelo em cascata?",
    "resposta":"atraso e não cumprimento de orçamento" 
  },
  {
    "id":21,
    "pergunta":"Quando um modelo em cascata deve ser utilizados?",
    "resposta":"quando os requisitos forem bem definidos e compreendidos e quando houver pouca chance de alterações radicais" 
  },
  {
    "id":22,
    "pergunta":"Porque o modelo em cascata é um método tradicional e fortemente prescritivo?",
    "resposta":"sempre busca dizer o que fazer de forma bem detalhada e uma extensa documentação" 
  },
  {
    "id":23,
    "pergunta":"O que é o modelo V",
    "resposta":"uma variação do modelo em cascata que preza pela garantia da qualidade em cada fase atrvés de testes após cada fase concluída" 
  },
  {
    "id":24,
    "pergunta":"O que é modelo incremental?",
    "resposta":"várias equipes desenvolvendo uma parte do software a serem integradas no final" 
  },
  {
    "id":25,
    "pergunta":"O que é modelo iterativo?",
    "resposta":"versões com melhorias vão sendo lançandas a fim de integrar o sistemas até que seja completamente entregue" 
  },
  {
    "id":26,
    "pergunta":"Qual a vantagem do modelo incremental iterativo em relação ao custo das mudanças nos requisitos?",
    "resposta":"muito menor" 
  },
  {
    "id":27,
    "pergunta":"Qual a vantagem do modelo incremental iterativo em relação a obtença~de feedbacks?",
    "resposta":"mais fácil" 
  },
  {
    "id":28,
    "pergunta":"Qual a vantagem do modelo incremental iterativo em relação a entrega de um sofware útil??",
    "resposta":"mais rápido" 
  },
  {
    "id":29,
    "pergunta":"Existem dois problemas no modelo evolucionário sendo um deles o do processo não visível, o que isso quer dizer?",
    "resposta":"como são desenvolvidos rapidamente, não são produzidos documentos para cada versão" 
  },
  {
    "id":30,
    "pergunta":"Existem dois problemas no modelo evolucionário sendo um deles o de os sistemas serem mal estruturados, o que isso quer dizer?",
    "resposta":"muitas mudanças tende a corromper a estrutura do software" 
  },
  {
    "id":31,
    "pergunta":"Qual é o foco do modelo incremental?",
    "resposta":"a entrega de um produto operacional a cada incremento" 
  },
  {
    "id":32,
    "pergunta":"Qual é o primeiro incremento de um modelo incremental?",
    "resposta":"um produto essencial" 
  },
  {
    "id":33,
    "pergunta":"O que é RAD como modelo de ciclo de vida",
    "resposta":"é um ciclo de vida iterativo e incremental com foco em desenvolvimento de curto prazo" 
  },
  {
    "id":34,
    "pergunta":"O significa RAD como modelo de ciclo de vida?",
    "resposta":"rapid application development" 
  },
  {
    "id":34,
    "pergunta":"Quanto tempo dura mais ou menos o ciclo RAD?",
    "resposta":"entre 60 e 90 dias" 
  },
  {
    "id":35,
    "pergunta":"Porque o desenvolvimento ocorre tão rápido no ciclo RAD?",
    "resposta":"porque é utilizado o reúso dos componentes" 
  },
  {
    "id":36,
    "pergunta":"Quais são as fases de um ciclo RAD?",
    "resposta":"modelagem de negócios, modelagem de dados, modelagem de processo, geração de aplicação e teste de modificação" 
  },
  {
    "id":37,
    "pergunta":"Se forem condesadas as fases do ciclo RAD, como são chamadas as etapas condensadas?",
    "resposta":"etapa de modelagem e etapa de construção" 
  },
  {
    "id":38,
    "pergunta":"Qual a base do modelo RAD?",
    "resposta":"é baseado em componentes" 
  },
  {
    "id":39,
    "pergunta":"Quais são os modelos evolucionários mais usados?",
    "resposta":"prototipagem e espiral" 
  },
  {
    "id":40,
    "pergunta":"Qual a diferença entre um modelo iterativo incremental e iterativo evolucionário?",
    "resposta":"no modelo iterativo incremental os incrementos devem ser operacionais desde o início, já nos evolucionários não é necessário que sejam sempre operacionais" 
  },
  {
    "id":41,
    "pergunta":"Quando a prototipação é utilizada?",
    "resposta":"quando os requisitos ainda não estão claros" 
  },
  {
    "id":42,
    "pergunta":"O que é um protótipo?",
    "resposta":"é uma versão inicial de um sistema" 
  },
  {
    "id":43,
    "pergunta":"Como o modelo de protipagem ajuda no construção final do produto?",
    "resposta":"ajuda no levantameno dos requisitos e depois é descartado ou é refinado e evolui até chegar ao produto final" 
  },
  {
    "id":44,
    "pergunta":"O que é o modelo em espiral?",
    "resposta":"é um modelo iterativo evolucionáirio que combina os modelos em cascata e prototipagem" 
  },
  {
    "id":45,
    "pergunta":"Como são dividas as fases no modelo em espiral?",
    "resposta":"em loops" 
  },
  {
    "id":46,
    "pergunta":"Como é divido o modelo espiral?",
    "resposta":"em quatro setores" 
  },
  {
    "id":47,
    "pergunta":"Quais são os setores do modelo espiral?",
    "resposta":"determinar objetivos, avaliar alternativas, desenvolver e testar, planejar próximas fases" 
  },
  {
    "id":48,
    "pergunta":"Qual é o conceito essencial do modelo em espiral?",
    "resposta":"minimizar os riscos" 
  },
  {
    "id":49,
    "pergunta":"Para que tipo de problemas é recomendado o modelo espiral?",
    "resposta":"para problemas complexos" 
  },
  {
    "id":50,
    "pergunta":"O que o modelo espiral usa como modelo de redução de risco?",
    "resposta":"prototipação" 
  },
  {
    "id":51,
    "pergunta":"Onde são utilizados os métodos formais como modelo de ciclo de vida?",
    "resposta":"em ambientes bastante complexos com requisitos rigorosos" 
  },
  {
    "id":52,
    "pergunta":"Em que se baseiam os métodos formais?",
    "resposta":"são abordagens baseadas em matemática" 
  },
  {
    "id":53,
    "pergunta":"Em que se baseia o modelo baseado em componentes?",
    "resposta":"reúso" 
  },
  {
    "id":54,
    "pergunta":"O que programação orientada a aspectos?",
    "resposta":"é o modelo que separa respossabilidades, requsistos e interesses de um sistema" 
  },
  {
    "id":55,
    "pergunta":"O que se pode dizer sobre POA e POO?",
    "resposta":"são complementares" 
  },
  {
    "id":56,
    "pergunta":"Qual é o foco do modelo POA?",
    "resposta":"foca na separação de interesses" 
  },
  {
    "id":57,
    "pergunta":"O que são interesses no modelo POA?",
    "resposta":"são requisitos que devem ser atendidos, mas não pertencem ao domínio do negócio" 
  },
  {
    "id":58,
    "pergunta":"Quais são os tipos de interesses no modelo POA?",
    "resposta":"interesser principais e interesses ortogonais" 
  },
  {
    "id":59,
    "pergunta":"O que são aspectos no modelo POA?",
    "resposta":"são os módulos onde os interesses são carregados" 
  }
]